Repository: l33loo/forum-daf
Catalog: translations/messages+intl-icu.*.xlf
Languages: pt

source: Welcome to DAF forum
pt: Benvindo ao forum DAF

source: Forum API project, driven by Symfony 7 and PHP 8.3, serves as the nucleus of learning, introducing students to the realms of DDD, Hexagonal Architecture, and CQRS.
pt: O projeto Forum API, feito em Symfony 7 e PHP 8.3, serve como base de aprendizagem, apresentando aos alunos os domínios do DDD, Arquitetura Hexagonal e CQRS.

source: Home
pt: Início

source: Users
pt: Utilizadores

source: Login
pt: Iníciar sessão

source: Showing
pt: Mostrar

source: entries.
pt: registos.

source: prev
pt: anterior

source: next
pt: seguinte

source: {start}-{end} of {count} people
pt: do {start} ao {end}, de {count} pessoas

source: All rights reserved
pt: Todos os direitos reservados

source: Profile
pt: Perfil

source: Logout
pt: Terminar sessão

source: Create new account
pt: Criar conta

source: Already have an account?
pt: Já tem conta?

source: Banned account
pt: Conta banida

source: {name}'s profile
pt: Perfil de {name}

source: Account details
pt: Detalhes de conta

source: Personal details
pt: Detalhes pessoais

source: Change password
pt: Alterar palavra-passe

source: Account operations
pt: Opções de conta

source: Remove account
pt: Remover conta

source: Ban user
pt: Banir utilizador

source: Name
pt: Nome

source: Role
pt: Permissões

source: Banned
pt: Banido

source: Admin
pt: Administrador

source: User
pt: Utilizador

source: Edit
pt: Editar

source: Login to your account
pt: Iníciar sessão na sua conta

source: Email address
pt: Endereço de email

source: Password
pt: Palavra-passe

source: I forgot password
pt: Eu esqueci a palavra-passe

source: Remember me on this device
pt: Relembrar-me neste dispositivo

source: Don't have an account yet?
pt: Não tem uma conta ainda?

source: Register
pt: Registar

source: Account
pt: Conta

source: Please note:
pt: Atenção:

source: Deleting your account will permanently remove all your personal information, including your profile and settings. However, your forum posts (questions and answers) will remain visible, but they will be attributed to an "Unknown User". Once your account is deleted, you will not be able to regain access to any data or restore your previous account.
pt: Eliminar a sua conta irá remover todos os seus dados pessoais, incluíndo o seu perfil e definições. No entanto, os seus artigos no forum (perguntas e respostas) irão continuar visíveis mas serão atribuídos a um "Utilizador desconhecido". Uma vez eliminada a sua conta, não voltará a ter acesso a quasquer dados ou restaurar a sua conta.

source: If you choose to return to the forum, you are welcome to create a new account, but it will be treated as an entirely new account without any connection to your previous activity.
pt: Se optar por retornar ao fórum, poderá criar uma nova conta, mas esta será tratada como uma nova conta, sem qualquer ligação com sua atividade anterior.

source: Forgot password
pt: Esqueci-me da palavra-passe

source: To reset your password, please provide the email address you used during registration.
pt: Para alterar a sua palavra-passe, por favor, indique o endereço de email usado no processo de registo.

source: Send reset link
pt: Enviar link

source: Make sure your email address has been verified. If these conditions are met, you'll receive an email with a link to reset your password.
pt: Certifique-se que o seu endereço de email foi verificado. Se estas condições se verificarem, receberá um email com o link para alaterar a sua palavra-passe.

source: Forget it, {start_link}send me back{end_link} to the login screen.
pt: Esquece, regressa à página de {start_link}início de sessão{end_link}.

source: Change your password
pt: Altarer a sua palavra-passe

source: Hi {name}, please create your new password below to complete the reset.
pt: Olá {name}, por favor crie a sua nove palavra-passe para concluir o processo.

source: Change
pt: Alterar

source: Attention:
pt: Atenção:

source: will be shown to the user upon login attempts.
pt: será mostrado ao utilizador nas tentativas de iniciar a sessão.

source: Ban user!
pt: Banir utilizador!

source: Your email address has not been verified yet.
pt: O seu endereço de email ainda não foi verificado.

source: Please check your inbox for the verification email. If you didn’t receive it, click the button below to resend the confirmation link.
pt: Por favor verifique o seu correio. Se não recebeu a mensagem de verificação de email clique no botão abaixo para lhe ser reenviado o link.

source: Update
pt: Atualizar

source: User name
pt: Nome de utilizador

source: Email address is used for authentication. It cannot be blank.
pt: O endereço de email é usado na autenticação. Não pode estar em branco.

source: Invalid mail address.
pt: Endereço de email inválido.

source: The ban reason will be presented to the user when he tries to log in. It cannot be blank.
pt: A rasão para banir o utilizador ser-lhe-á apresentada sempre que este tentar iniciar uma sessão. Tem de ser escrita.

source: User name cannot be blank.
pt: O nome de utiliozador não pode estar vasio.

source: Please enter the account email address to remove account.
pt: Por favor indique o endereço de email da conta a remover.

source: Email address will be used to identify your account. It cannot be blank.
pt: O endereço de email é usado na identificação da sua conta. Não pode estar em branco.

source: Current password
pt: Palavra-passe atual

source: New password
pt: Nova palavra-passe

source: Repeat Password
pt: Confirme a palavra-passe

source: User was successfully added.
pt: O utilizador foi adicionado com sucesso.

source: User details were successfully updated!
pt: Detalhes de conta atualizados com sucesso!

source: A new verification email has been sent to your inbox. Please check your email to complete the verification process.
pt: Uma mensagem de verificação do endereço de email foi enviada para a sua caixa de correio. Verifique o seu correio para completar o processo de verificação.

source: If there is a user with the provided email address, a link to reset your password will be sent to you.
pt: Se existir um utilizador criado com este endereço será enviada uma mensagem com um link para a alteração da palavra-passe.

source: Your current password is incorrect.
pt: A sua palavra-passe atual está incorreta.

source: Password has been changed successfully.
pt: A palavra-passe foi alterada com sucesso.

source: A user with email '{mail}' already exists
pt: Já existe um utilizador registado com o endereço de email "{mail}"

source: Validation token has expired. Please request a new email confirmation.
pt: O pedido de validação expirou. Por favor peça um novo email para confirmação.

source: Confirm Your Email Address - Forum DAF
pt: Confirme o seu endereço de emal- Forum DAF

source: Reset Your Password - Forum DAF
pt: Alterar palavra-passe - Forum DAF

# Enter email address &quot;{email}&quot; to delete your account
source: Enter email address "{email}" to delete your account
pt: Introduza o endereço de email "{email}" para eliminar a sua conta

source: Users list
pt: Lista de utilizadores

source: Ban {name} ({email})
pt: Banir o utilizdor {name} ({email})

source: {name}, your password was successfully changed.
pt: {name}, a sua palavra-passe foi alterada com sucesso.

source: Thank you {name}! Your email address has been confirmed. Your account details are now completed.
pt: Obrigado {name}! O seu endereço de email foi verificado. Os seus dados de conta estão completos.

source: The email address {email} is already taken by other user. Please try a different email address.
pt: O endereço de email {email} está associado a outra conta de utilizador. Tente de novo com um endereço diferente.

source: Welcome a board {name}! You have been registered.
pt: Seja benvindo {name}! Foi registado com sucesso.

source: {name}, your account has been successfully deleted. We're sorry to see you go, but you're always welcome to return and create a new account in the future. Thank you for being a part of our community!
pt: {name}, a sua conta foi eliminada com sucesso. Lamentamos que tenha removido a sua conta mas poderá sempre voltar e criar uma nova no futuro. Obrigado por fazer parte da nossa comunidade!

source: When banning a user, please provide a reason for the ban. This reason will be displayed to the user whenever they attempt to log in with the banned email address. Keep in mind that once banned, the user will no longer be able to access the site using that email address. It is important to provide a clear and valid reason, as it will be shown to the user upon login attempts.
pt: É necessário indicar a razão para banir o utilizador. Esta informação será mostrada ao utilizador sempre que este tente iniciar uma sessão com o endereço de email da conta banida. Tenha em atenção que uma vez eliminada a conta o utilizador não será capaz de aceder ao site usando esse endereço de email. É importante que forneça uma razão clara e válida uma vez que esta irá ser mostrada ao utilizador sempre que tentar iniciar uma sessão.

source: Ban reason
pt: Razão para banir

source: License
pt: Licença

source: Search users…
pt: Procurar utilizadores…

source: Add user
pt: Novo utilizador

source: Forum DAF Licence
pt: Licença

source: Registered users
pt: Utilizadores registados
